Revit 2027 API
SpecTypeId.Int.NumberOfPoles Property
 Number of Poles, in discipline Electrical.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId NumberOfPoles { get; }
Public Shared ReadOnly Property NumberOfPoles As ForgeTypeId
	Get
public:
static property ForgeTypeId^ NumberOfPoles {
	ForgeTypeId^ get ();
}
static member NumberOfPoles : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
SpecTypeId.Int Class
Autodesk.Revit.DB Namespace